app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title"], ["summary", "Summary"], ["body", "Body"], ["created_at", "2018-11-07 21:29:21.272763"], ["updated_at", "2018-11-07 21:29:21.272763"]]

    def update
        # @post = Post.find(params[:id])
        if @post.update_attributes(post_params)
---
UPDATE "posts" SET "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["summary", "qsdasd"], ["updated_at", "2018-12-04 22:50:47.540550"], ["id", 22]]

    def destroy
        # @post = Post.find(params[:id])
        @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 18]]