app/models/post.rb

    def all_tags
    	self.tags.map(&:name).join(', ')
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 23]]

    def all_tags=(names)
    	self.tags = names.split(',').map do |name|
    		Tag.where(name: name.strip).first_or_create!
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "backend"], ["created_at", "2018-12-18 01:28:29.842453"], ["updated_at", "2018-12-18 01:28:29.842453"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["name", "backend"], ["LIMIT", 1]]